src/test/soap-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="EK-BAEEA775F22ECFB59E13776691993774">
				<xenc:EncryptionMethod
					Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>CN=tongtech.com,C=CN</ds:X509IssuerName>
								<ds:X509SerialNumber>1419400525</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>E0Mq3rKV+Y1IedpLjfoVjY74AZuV+JBd98AXQ5xFlgZnKjTZ863YdrOYXKTLiHPuH6m/vvw282o3ck58brqPLDjNDat9y/9Ph0trGy5PkuFGO3fi2dNC/2dEPpMQGsMmVfMEU1czKOfuo6ffk6TN5vp2Q1731l+Z3JjoaPq77V9AWqkfeFvCJZSzvT/LKI6R2kfyjnb6Nb9u+i1EAgBDnQhjPGIQEeUQ9JPVRhy8ZAwuIg5gPpVXptgC0BHvmikS16UjF2F1XIyqvj1eHOKiym65AGAlWyQDJL89iGCMaLMlzQUDZdhtop/yB+joDXEaHDId9ijw1KjoZO9NTjLepA==</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference URI="#ED-4" />
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="SIG-3">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="soap" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#id-2">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>YDM7LtvC2kUAGgqViLwqTkjbwUU=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>lhkkUA/G3f5st23MnPnx7BhjFi6LC0VKmN71jpsJDnoeG8aHuKXd/fGMNu7J818xN8WA1Na6HnHsAyY9+3STjf5B55iXzpQbbr6h6Xjd8LXZEw+y73FB85XxDyl/XroY6n/KW8Qd+CMTuu2+fCVtNKacAoge8JWWueUML4ibnVsNbtUh3xME+xEUhvpy8jS4SiFYCO3CIoduaaviMML53+SR9B4OwNj2gcZDYJjTTAepysQw+UsW/SJ086yf8SdrJQ+c1naRlPwBEa/zxADXSYEsijcHkDqqar1G3wuIzEhc+UkAJJu8O7bkc3YurUWj6A5NCTnYXSoWFlWzyVEeBw==</ds:SignatureValue>
				<ds:KeyInfo Id="KI-BAEEA775F22ECFB59E13776691992342">
					<wsse:SecurityTokenReference wsu:Id="STR-BAEEA775F22ECFB59E13776691992353">
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>CN=tongtech.com,C=CN</ds:X509IssuerName>
								<ds:X509SerialNumber>1109755317</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
			<wsu:Timestamp wsu:Id="TS-1">
				<wsu:Created>2013-08-28T05:53:19.216Z</wsu:Created>
				<wsu:Expires>2013-08-28T05:58:19.216Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</SOAP-ENV:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="id-2">
		<xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
			Id="ED-4" Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference
					xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
					<wsse:Reference URI="#EK-BAEEA775F22ECFB59E13776691993774" />
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>4mFH+rErg4/EIxxUYdEDm83miiHbijNBn2RfzSgPqOUJ7OInndXd34Jdodohzv4g4+TE4EjFPMVpOvmHOkOGEx4dWKLRW7ZhYeITI7zC1lcrPW+eg7W4M1bJebNkAj+uoFSBFGIow0WOvLNHTg+n4A==</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soap:Body>
</soap:Envelope>